HOSTNAME CHANGE

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#host
Router(config)#hostname R1
R1(config)#

ENTRY USER PASSWORD

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#line console 0
Router(config-line)#password berlin
Router(config-line)#login
Router(config-line)#exit

User Access Verification

Password: berlin

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#enable password berlin2
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router>en
Password:berlin2




SWICH PASSWORD CONFIGURATION



Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#line con
Switch(config)#line console 0
Switch(config-line)#pass
Switch(config-line)#password berlin
Switch(config-line)#login
Switch(config-line)#exit
Switch(config)#enable pa
Switch(config)#enable password berlin2
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console
 