Router> en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#host
Router(config)#hostname R1
R1(config)#int s0/3/0
R1(config-if)#no shu
R1(config-if)#no shutdown 

R1(config-if)#
%LINK-5-CHANGED: Interface Serial0/3/0, changed state to up

R1(config-if)#enc
R1(config-if)#encapsulation ?
  frame-relay  Frame Relay networks
  hdlc         Serial HDLC synchronous
  ppp          Point-to-Point protocol
R1(config-if)#encapsulation fr
R1(config-if)#encapsulation frame-relay 
R1(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/3/0, changed state to up

R1(config-if)#exit
R1(config)#int s0/3/0.1 ?
  multipoint      Treat as a multipoint link
  point-to-point  Treat as a point-to-point link
  <cr>
R1(config)#int s0/3/0.1 p
R1(config)#int s0/3/0.1 point-to-point 
R1(config-subif)#
%LINK-5-CHANGED: Interface Serial0/3/0.1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/3/0.1, changed state to up

R1(config-subif)#ip add
R1(config-subif)#ip address 10.0.0.1 255.0.0.0
R1(config-subif)#fra
R1(config-subif)#frame-relay int
R1(config-subif)#frame-relay interface-dlci 201
R1(config-subif)#exit
R1(config)#int
R1(config)#interface s0/3/0.2 ?
  multipoint      Treat as a multipoint link
  point-to-point  Treat as a point-to-point link
  <cr>
R1(config)#interface s0/3/0.2 p
R1(config)#interface s0/3/0.2 point-to-point 
R1(config-subif)#
%LINK-5-CHANGED: Interface Serial0/3/0.2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/3/0.2, changed state to up

R1(config-subif)#ip add
R1(config-subif)#ip address 20.0.0.1 255.0.0.0
R1(config-subif)#fram
R1(config-subif)#frame-relay int
R1(config-subif)#frame-relay interface-dlci 101
R1(config-subif)#exit
R1(config)#