Router#en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router
Router(config)#router ?
  bgp    Border Gateway Protocol (BGP)
  eigrp  Enhanced Interior Gateway Routing Protocol (EIGRP)
  ospf   Open Shortest Path First (OSPF)
  rip    Routing Information Protocol (RIP)
Router(config)#router bgp ?
  <1-65535>  Autonomous system number
Router(config)#router bgp 100
Router(config-router)#net
Router(config-router)#network 192.168.1.0
Router(config-router)#net
Router(config-router)#network 10.0.0.0
Router(config-router)#nei
Router(config-router)#neighbor ?
  A.B.C.D  Neighbor address
Router(config-router)#?
  bgp              BGP specific commands
  distance         Define an administrative distance
  exit             Exit from routing protocol configuration mode
  neighbor         Specify a neighbor router
  network          Specify a network to announce via BGP
  no               Negate a command or set its defaults
  redistribute     Redistribute information from another routing protocol
  synchronization  Perform IGP synchronization
  timers           Adjust routing timers
Router(config-router)#nei
Router(config-router)#neighbor remot
Router(config-router)#neighbor 10.0.0.2 ?
  next-hop-self  Disable the next hop calculation for this neighbor
  remote-as      Specify a BGP neighbor
Router(config-router)#neighbor 10.0.0.2 re
Router(config-router)#neighbor 10.0.0.2 remote-as 200
Router(config-router)#%BGP-5-ADJCHANGE: neighbor 10.0.0.2 Up

Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#sh ip rou
Router#sh ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       10.0.0.0/8 is directly connected, Serial0/2/0
L       10.0.0.1/32 is directly connected, Serial0/2/0
B    20.0.0.0/8 [20/0] via 10.0.0.2, 00:00:00
     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, FastEthernet0/0
L       192.168.1.1/32 is directly connected, FastEthernet0/0
B    192.168.2.0/24 [20/0] via 10.0.0.2, 00:00:00
B    192.168.3.0/24 [20/0] via 10.0.0.2, 00:00:00

Router#